; domain
(define (domain ranchyard)
(:requirements :typing :fluents)
(:types range range_asset - object
  homestead outpost - range
        wagon lariat platform - range_asset
        skid bale - platform)

(:predicates (grazing_at ?x - range_asset ?y - range)
             (stacked_on ?x - bale ?y - platform)
             (loaded_in ?x - bale ?y - wagon)
             (hauling ?x - lariat ?y - bale)
             (ready ?x - lariat)
             (bare ?x - platform)
)

(:functions
  (wagon_cap ?t - wagon)
  (current_haul ?t - wagon)
  (mass ?c - bale)
  (feed-cost)
)

(:action mosey
:parameters (?x - wagon ?y - range ?z - range)
:precondition (and (grazing_at ?x ?y))
:effect (and (not (grazing_at ?x ?y)) (grazing_at ?x ?z)
    (increase (feed-cost) 10)))

(:action rope_up
:parameters (?x - lariat ?y - bale ?z - platform ?p - range)
:precondition (and (grazing_at ?x ?p) (ready ?x) (grazing_at ?y ?p) (stacked_on ?y ?z) (bare ?y))
:effect (and (not (grazing_at ?y ?p)) (hauling ?x ?y) (not (bare ?y)) (not (ready ?x))
             (bare ?z) (not (stacked_on ?y ?z)) (increase (feed-cost) 1)))

(:action rope_down
:parameters (?x - lariat ?y - bale ?z - platform ?p - range)
:precondition (and (grazing_at ?x ?p) (grazing_at ?z ?p) (bare ?z) (hauling ?x ?y))
:effect (and (ready ?x) (not (hauling ?x ?y)) (grazing_at ?y ?p) (not (bare ?z)) (bare ?y)
    (stacked_on ?y ?z)))

(:action wrangle_in
:parameters (?x - lariat ?y - bale ?z - wagon ?p - range)
:precondition (and (grazing_at ?x ?p) (grazing_at ?z ?p) (hauling ?x ?y)
    (<= (+ (current_haul ?z) (mass ?y)) (wagon_cap ?z)))
:effect (and (not (hauling ?x ?y)) (loaded_in ?y ?z) (ready ?x)
    (increase (current_haul ?z) (mass ?y))))

(:action wrangle_out
:parameters (?x - lariat ?y - bale ?z - wagon ?p - range)
:precondition (and (grazing_at ?x ?p) (grazing_at ?z ?p) (ready ?x) (loaded_in ?y ?z))
:effect (and (not (loaded_in ?y ?z)) (not (ready ?x)) (hauling ?x ?y)
    (decrease (current_haul ?z) (mass ?y))))

)

; problem
(define (problem ranchyard-p02) (:domain ranchyard)
(:objects
	homestead0 - homestead
	outpost0 - outpost
	wagon0 - wagon
	skid0 skid1 skid2 - skid
	bale0 bale1 bale2 - bale
	lariat0 lariat1 lariat2 - lariat)
(:init
	(grazing_at skid0 homestead0)
	(bare bale2)
	(grazing_at skid1 outpost0)
	(bare bale1)
	(grazing_at skid2 homestead0)
	(bare bale0)
	(grazing_at wagon0 outpost0)
	(= (current_haul wagon0) 0)
	(= (wagon_cap wagon0) 483)
	(grazing_at lariat0 homestead0)
	(ready lariat0)
	(grazing_at lariat1 outpost0)
	(ready lariat1)
	(grazing_at lariat2 outpost0)
	(ready lariat2)
	(grazing_at bale0 homestead0)
	(stacked_on bale0 skid2)
	(= (mass bale0) 24)
	(grazing_at bale1 outpost0)
	(stacked_on bale1 skid1)
	(= (mass bale1) 66)
	(grazing_at bale2 homestead0)
	(stacked_on bale2 skid0)
	(= (mass bale2) 91)
	(= (feed-cost) 0)
)

(:goal (and
		(stacked_on bale1 bale2)
		(stacked_on bale2 skid0)
	)
)

(:metric minimize (total-time)))

; plan
1. (rope_up lariat1 bale1 skid1 outpost0)
   deleted: (grazing_at bale1 outpost0) (bare bale1) (ready lariat1) (stacked_on bale1 skid1)
   added: (hauling lariat1 bale1) (bare skid1)
   changed: (feed-cost) from 0 to 1
   goals met: 1 of 2
2. (wrangle_in lariat1 bale1 wagon0 outpost0)
   deleted: (hauling lariat1 bale1)
   added: (loaded_in bale1 wagon0) (ready lariat1)
   changed: (current_haul wagon0) from 0 to 66
   goals met: 1 of 2
3. (mosey wagon0 outpost0 homestead0)
   deleted: (grazing_at wagon0 outpost0)
   added: (grazing_at wagon0 homestead0)
   changed: (feed-cost) from 1 to 11
   goals met: 1 of 2
4. (wrangle_out lariat0 bale1 wagon0 homestead0)
   deleted: (loaded_in bale1 wagon0) (ready lariat0)
   added: (hauling lariat0 bale1)
   changed: (current_haul wagon0) from 66 to 0
   goals met: 1 of 2
5. (rope_down lariat0 bale1 bale2 homestead0)
   deleted: (hauling lariat0 bale1) (bare bale2)
   added: (ready lariat0) (grazing_at bale1 homestead0) (bare bale1) (stacked_on bale1 bale2)
   goals met: 2 of 2
